app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 11 Nov 2012 16:50:34 UTC +00:00], ["name", "Gold"], ["updated_at", Sun, 11 Nov 2012 16:50:34 UTC +00:00]]