app/controllers/products_controller.rb

  def new
    @product = Product.new
    @categories = Category.order(:name)
---
SELECT "categories".* FROM "categories" ORDER BY name

  def edit
    @product = Product.find(params[:id])
    @categories = Category.order(:name)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "categories".* FROM "categories" ORDER BY name

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("category_id", "created_at", "description", "image", "name", "price", "quantity_on_hand", "sale_price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "image" = 'spanishGoldDoubloon.jpg', "updated_at" = '2012-11-13 15:03:39.789287' WHERE "products"."id" = 1

  def search_results
    @keywords = params[:keywords]
    @products = Product.where('name LIKE ?', "%#{@keywords}%")
---
SELECT "products".* FROM "products" WHERE (name LIKE '%spanish%')