app/controllers/provinces_controller.rb

SELECT "provinces".* FROM "provinces"
---
  def index
    @provinces = Province.all