app/controllers/reviews_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" IN (1, 3, 2)
SELECT "reviews".* FROM "reviews"
---
  def index
    @reviews = Review.includes(:product).all

INSERT INTO "reviews" ("author", "body", "created_at", "product_id", "rating", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @review = Review.new(params[:review])

    if @review.save