app/controllers/store_controller.rb

SELECT "products".* FROM "products"
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" IN (1, 2, 3)
---
  def index
    @products = Product.includes(:reviews)