app/views/store/_item.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" IN (1, 2, 3)
---
        <!-- Doing some ruby magic so abominations such as "There are 1 review" do not see the light of day -->
        <% count = product.reviews.size == 1 ? 'is' : 'are' %>